; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph1 - mode
	image2 - mode
	image0 - mode
	Star4 - direction
	GroundStation5 - direction
	Star3 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 image2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star4)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(supports instrument5 image2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star6)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 image0)
	(supports instrument10 spectrograph1)
	(supports instrument10 image2)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite5 GroundStation0)
	(have_image Phenomenon7 image2)
	(have_image Planet8 image2)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon10 image0)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 image0)
	(have_image Star13 spectrograph1)
	(have_image Planet14 image2)
))

)

; plan
1. (turn_to satellite5 groundstation0 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 groundstation0)
   goals met: 1 of 10
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 10
3. (calibrate satellite3 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 1 of 10
4. (turn_to satellite3 phenomenon9 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 10
5. (take_image satellite3 phenomenon9 instrument5 image2)
   added: (have_image phenomenon9 image2)
   goals met: 2 of 10
6. (turn_to satellite3 phenomenon7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon7)
   goals met: 2 of 10
7. (take_image satellite3 phenomenon7 instrument5 image2)
   added: (have_image phenomenon7 image2)
   goals met: 3 of 10
8. (turn_to satellite3 phenomenon12 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon12)
   goals met: 3 of 10
9. (take_image satellite3 phenomenon12 instrument5 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 10
10. (turn_to satellite3 phenomenon10 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon10)
   goals met: 4 of 10
11. (turn_to satellite1 star4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star4)
   goals met: 5 of 10
12. (take_image satellite3 phenomenon10 instrument5 image0)
   added: (have_image phenomenon10 image0)
   goals met: 6 of 10
13. (turn_to satellite3 planet11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet11)
   goals met: 6 of 10
14. (take_image satellite3 planet11 instrument5 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 7 of 10
15. (turn_to satellite3 planet14 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet14)
   goals met: 7 of 10
16. (take_image satellite3 planet14 instrument5 image2)
   added: (have_image planet14 image2)
   goals met: 8 of 10
17. (turn_to satellite3 planet8 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet8)
   goals met: 8 of 10
18. (take_image satellite3 planet8 instrument5 image2)
   added: (have_image planet8 image2)
   goals met: 9 of 10
19. (turn_to satellite3 star13 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star13)
   goals met: 9 of 10
20. (take_image satellite3 star13 instrument5 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 10 of 10
